🚀&nbsp; env0 had composed a PR Plan for environment [Shenanigans / acme-demo simple-ec2-instance ](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acme-ec2.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0cd202468248306f2" -> "ami-0a15226b1f7f23580" # forces replacement
!       arn                                  = "arn:aws:ec2:us-west-2:244172364962:instance/i-00a3d8a53ca05e968" -> (known after apply)
!       availability_zone                    = "us-west-2b" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 2 -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
!       id                                   = "i-00a3d8a53ca05e968" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       instance_type                        = "t3a.small" -> "t3a.medium"
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       primary_network_interface_id         = "eni-0af5cbb5de8bc39d5" -> (known after apply)
!       private_dns                          = "ip-10-0-3-165.us-west-2.compute.internal" -> (known after apply)
!       private_ip                           = "10.0.3.165" -> (known after apply)
+       public_dns                           = (known after apply)
!       public_ip                            = "54.185.159.91" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
!       tags                                 = {
!           "Demo"      = "Dec 31" -> "May 20"
            "Name"      = "env0-acme-ec2"
            "Owner"     = "acme demo org"
            "Terraform" = "true"
!           "Test"      = "new tag" -> "new taga"
        }
!       tags_all                             = {
!           "Demo"      = "Dec 31" -> "May 20"
!           "Test"      = "new tag" -> "new taga"
            # (3 unchanged elements hidden)
        }
!       vpc_security_group_ids               = [
-           "sg-08fdaac30443c7649",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

-       enclave_options {
-           enabled = false -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_put_response_hop_limit = 1 -> null
-           http_tokens                 = "optional" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/sda1" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-017793bccfdafd96d" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   instances  = [
-       "i-00a3d8a53ca05e968",
+       (known after apply),
    ]
!   private_ip = [
-       "10.0.3.165",
+       (known after apply),
    ]
!   public_ip  = [
-       "54.185.159.91",
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($15 → $28)
Percent: +94%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: env0/acme-demo/.env0workdir/env0_tf_plan.json

! module.acme-ec2.aws_instance.this[0]
  +$14 ($15 → $28)

!     Instance usage (Linux/UNIX, on-demand, t3a.small → t3a.medium)
      +$14 ($14 → $27)

Monthly cost change for env0/acme-demo/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($15 → $28)
Percent: +94%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

1 cloud resource was detected:
∙ 1 was estimated

Infracost estimate: Monthly estimate increased by $14 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ env0/acme-demo/.env0workdir/env0_tf_plan.json      ┃          +$14 ┃           - ┃  +$14 (+94%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7/deployments/b4cdeee6-74c8-4f56-86a1-94cdaefafee3?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[![env0-ai-summary-banner](https://app.env0.com/images/vcs-comment-ai-summary-banner.png)](https://app.env0.com/p/989a5109-9f40-4770-970b-2e64bba46393/environments/52c05cc1-c80f-48b5-8c56-eacc2b7342f7/deployments/b4cdeee6-74c8-4f56-86a1-94cdaefafee3?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)